// —оздание кода T4 дл€ модели "C:\Users\»ван\Documents\Visual Studio 2017\Projects\TranslationReg\TranslationRegistryModel\TRegModel.edmx" включено. 
// „тобы включить формирование кода прежних версий, измените значение свойства "—тратеги€ создани€ кода" конструктора
// на "Legacy ObjectContext". Ёто свойство доступно в окне "—войства", если модель
// открыта в конструкторе.

// ≈сли не сформированы контекст и классы сущности, возможна€ причина в том, что вы создали пустую модель, но
// еще не выбрали версию Entity Framework дл€ использовани€. „тобы сформировать класс контекста и классы сущностей
// дл€ своей модели, откройте модель в конструкторе, щелкните правой кнопкой область конструктора и
// выберите "ќбновить модель из базы данных", "—формировать базу данных из модели" или "ƒобавить элемент формировани€
// кода...".